Revit 2026 API

# RebarShapeConstraint Class

---

A dimension or other constraint that takes part in a RebarShapeDefinition.

SystemObject Autodesk.Revit.DB.StructureRebarShapeConstraint More

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarShapeConstraint : IDisposable
```
```vb
Public Class RebarShapeConstraint
	Implements IDisposable
```
```cpp
public ref class RebarShapeConstraint : IDisposable
```
```fsharp
type RebarShapeConstraint =
    class
        interface IDisposable
    end
```

The RebarShapeConstraint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarShapeConstraint |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetParamId | Return the Id of the parameter associated with this constraint. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace

SystemObject Autodesk.Revit.DB.StructureRebarShapeConstraint Autodesk.Revit.DB.StructureRebarShapeConstraint180DegreeBendArcLength Autodesk.Revit.DB.StructureRebarShapeConstraint180DegreeBendRadius Autodesk.Revit.DB.StructureRebarShapeConstraint180DegreeDefaultBend Autodesk.Revit.DB.StructureRebarShapeConstraintAngleFromFixedDir Autodesk.Revit.DB.StructureRebarShapeConstraintArcLength Autodesk.Revit.DB.StructureRebarShapeConstraintChordLength Autodesk.Revit.DB.StructureRebarShapeConstraintCircumference Autodesk.Revit.DB.StructureRebarShapeConstraintDiameter Autodesk.Revit.DB.StructureRebarShapeConstraintFixedSegmentDir Autodesk.Revit.DB.StructureRebarShapeConstraintProjectedSegmentLength Autodesk.Revit.DB.StructureRebarShapeConstraintRadius Autodesk.Revit.DB.StructureRebarShapeConstraintSagittaLength Autodesk.Revit.DB.StructureRebarShapeConstraintSegmentLength